Revit 2024 API
BuiltInFailures.GeneralFailures.CharactersNotAllowed Property
 Name cannot contain any of the following characters:\n[{}[]|;<>?`~]\nor any of the non-printable characters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CharactersNotAllowed { get; }
Visual Basic
Public Shared ReadOnly Property CharactersNotAllowed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CharactersNotAllowed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace